class Translation(object):

      
      START_TEXT = """

😃 مرحبا  {},

أنا بوت حقوق القناة 
انا عملي أقوم بوضع رابط او نص  أخر اي منشور ينزل بالقناة  بشكل نلقائي

اضغط مساعدة لمعرفة طريقة استخدام البوت 

⚜️ مطور البوت  👉 @{}
"""    

      HELP_TEXT = """

<u>💡 مساعدة</u> 


👉 اولا ضيف البوت مشرف في قناتك مع الصلاحيات 

👉 قم باضافة حقوق قناتك من خلال الامر التالي   <code>/set_caption</code> 

<i>( فقط المشرفين  )</i>
   
<i>(يدعم الماركداون)</i>

👉 قم بارسال اي ملف في قناتك وساقوم باضافة حقوقك

<b><a href="https://t.me/AKM100YE">©️ مطور البوت</a></b>
"""    
              

     
      ABOUT_TEXT = """


📕 --حول- --البوت--


○ اسم البوت  : [بوت حقوق القناه](https://t.me/AKM100YE)

لغة البوت : بايثون  

○ الحزمة  : ᴘʏʀᴏɢʀᴀᴍ 

○ السرفر : ʜᴇʀᴏᴋᴜ 

○ النسخة  : 1.1.0

○ قناة البوت   : [قناة البوت  🤗](https://t.me/zawamlAnsarAllah)

○ مطور البوت  :  [هناااااا](https://t.me/AKM100YE)

**[©️  شكرا لاستخدامكم البوت](https://t.me/AKM100YE)**

"""

      MARKDOWN_TEXT = """

🔰 <u>حول الماركداون</u>


👉 <b>نص غامق </b>
      
📌 <code>**text**</code> 

👉 <b>نص مائل </b>

📌 <code>__text__</code> 

👉 <b>نص قابل للنسخ عند الضغط عليه</b>

📌 <code>`text`</code>   

👉 <b>رابط مخفي</b>

📌 <code>[نص الرابط](https://t.me/zawamlAnsarAllah)</code> 

<b><a href="https://t.me/zawamlAnsarAllah">©️ ᴛʀᴀᴄᴋsᴛᴜᴅɪᴏ's ʙᴏᴛs</a></b>

"""

# Bot status display

      STATUS_DATA = """

🔰 <u>حالة البوت</u>

🖌️ <b>الحقوق الحالية :</b>

{}

📐 <b>Current Position :</b> {}

<b><a href="https://t.me/AKM100YE">©️ مطور البوت </a></b>

"""

      NOT_ADMIN_TEXT = """

🔰 <u>المعذرة ياسيدي</u>

المعذره عزيزي فقط مطور البوت يستطيع مشاهدة احصائيات البوت  

<b><a href="https://t.me/AKM100YE">©️ مطور البووووت</a></b>

"""
